app/views/post_comments/_comments.html.erb

<h6>comments:<%= post_files.post_comments.count %></h6>
<table class="table">
  <% post_files.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_file_id" = ?  [["post_file_id", 4]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_file_id" = ?  [["post_file_id", 4]]