app/views/users/_index.html.erb

SELECT COUNT(*) FROM "post_files" WHERE "post_files"."user_id" = ?  [["user_id", 1]]
---
        <td><%= user.opinion %></td>
        <td><%= user.post_files.count %></td>