app/views/users/show.html.erb

        </tr>
        <% @user.post_files.each do |pf| %>
---
SELECT "post_files".* FROM "post_files" WHERE "post_files"."user_id" = ?  [["user_id", 1]]