app/views/searches/search.html.erb

              </td>
              <td><%= user.post_files.count %></td>
---
SELECT "post_files".* FROM "post_files" WHERE (title LIKE'%excel%')