app/views/post_files/index.html.erb

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_file_id" = ?  [["post_file_id", 2]]
---
            <th><%= postfiles.updated_at %></th>
            <th><%= postfiles.post_comments.count %></th>