app/controllers/post_comments_controller.rb

  def create
    post_file = PostFile.find(params[:post_file_id])
    comment = PostComment.new(post_comment_params)
    comment.user_id = current_user.id
    comment.post_file_id = post_file.id
    comment.save
---
SELECT  "post_files".* FROM "post_files" WHERE "post_files"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "post_file_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "とてもきれいな景色ですね。"], ["user_id", 1], ["post_file_id", 4], ["created_at", "2021-03-11 05:40:26.082246"], ["updated_at", "2021-03-11 05:40:26.082246"]]