app/controllers/post_files_controller.rb

INSERT INTO "post_files" ("title", "introduction", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sample"], ["introduction", "3files"], ["user_id", 1], ["created_at", "2021-03-09 19:24:04.347587"], ["updated_at", "2021-03-09 19:24:04.347587"]]
UPDATE "post_files" SET "updated_at" = ? WHERE "post_files"."id" = ?  [["updated_at", "2021-03-09 19:24:04.360026"], ["id", 1]]
---
  def create
    @postfiles = PostFile.create(post_files_params)
    @postfiles.user_id = current_user.id
    tag_list = params[:post_file][:name].split(",")
    @postfiles.save

SELECT "post_files".* FROM "post_files"
---
  def index
    #@postfiles_all = PostFile.all
    @postfiles_all = PostFile.order("#{sort_column} #{sort_direction}")

SELECT  "post_files".* FROM "post_files" WHERE "post_files"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @postfiles = PostFile.find(params[:id])

SELECT  "post_files".* FROM "post_files" WHERE "post_files"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @postfiles = PostFile.find(params[:id])

SELECT  "post_files".* FROM "post_files" WHERE "post_files"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @postfiles = PostFile.find(params[:id])

SELECT  "post_files".* FROM "post_files" WHERE "post_files"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "post_files" WHERE "post_files"."id" = ?  [["id", 1]]
---
  def destroy
    @postfiles = PostFile.find(params[:id])
    #@postfiles.files.purge
    @postfiles.destroy