app/controllers/searches_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE'%iiduka%')
SELECT "post_files".* FROM "post_files" WHERE (title LIKE'%excel%')
---
  def search
    @range = params[:range]
    search = params[:search]
    word = params[:word]
    sortstyle = params[:sortstyle]
    if @range =='1'
      @users = User.search(search,word)
    else
      @postfiles = PostFile.search(search,word,sortstyle)