app/controllers/users_controller.rb

    def update
      if @user.update(user_params)
---
UPDATE "users" SET "profile_image_id" = ?, "opinion" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["opinion", "数学が好きです。"], ["updated_at", "2021-03-09 08:51:56.129258"], ["id", 1]]